#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=fddcc4fc-b5bd-407c-9018-4e8348a278ea]
module.keycloak_dev.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=caaf14f5-6e9b-4142-9f2f-119ad0fac37b]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7af5bb55-d337-43fe-b601-35dfceb6b9ce]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5ea88be0-05eb-4cb4-b2d5-611e99f35b30]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=203caf5b-7262-4a5e-95e1-2016477c08ce]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b3a2ad3e-de7d-4181-bfd5-3f883f0f7620]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bde3707f-383d-4d20-a79d-e4c4f7931b1f]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdd1b368-149a-4755-899c-397f192c302d]
module.keycloak_dev.module.onestopauth.module.client_email-test-729.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=52231044-d2c7-4ad5-b95b-d20fddf75cc4]
module.keycloak_dev.module.onestopauth.module.client_email-test-729.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=de7d1ea2-611e-4af7-a430-9b901576c597]
module.keycloak_dev.module.onestopauth.module.client_email-test-729.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=242f8928-68cf-4df2-a9f2-88ad94a35bfc]
module.keycloak_dev.module.onestopauth.module.client_email-test-729.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b0e69f5d-788c-4686-b56e-9471cd53f585]
module.keycloak_dev.module.onestopauth.module.client_email-test-729.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=694f2504-d07a-4610-96d1-a5dc4beb7897]
module.keycloak_dev.module.onestopauth.module.client_email-test-729.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=edb3b3a6-5821-4c0a-aac8-17f7672cafcf]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c656a565-256a-42a4-83af-5483011c4a68]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b3f2acc6-6b1e-4a3a-9f5d-4863f2e46681]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ee5a4ae5-3860-408c-9236-cb19c6cc85b1]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5a56abd2-3eaa-4d7a-8bcc-14e76ba8ef1b]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=35d44640-1799-439a-a15f-a40a5c40ede2]
module.keycloak_dev.module.onestopauth.module.client_test-9-341.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=78964452-06f5-4668-b095-fc1adc7c9e9f]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=03d42548-58a2-4750-a43b-d832f4c9cb17]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9992e76a-992d-4f0c-948c-c9f7a4b3e50c]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b72b63a8-c47f-4b8f-9b2a-7fa98afc6d21]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8d452fa7-874f-4874-919d-c7f5c4677bbb]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f88ab6d3-ac51-4f37-b8ca-d641cf90c4b0]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1d9188d3-1408-4386-90f9-7ca99fd0fc60]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fbc74ef-069e-4d0e-8003-28336fd88871]
module.keycloak_dev.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3b66219f-1beb-4688-9de0-8ac90bf88f05]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a9db200b-c76e-4dd3-9cd4-7d34ba1f7e80]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1dbd9344-e118-45b1-91ed-b16360fe9535]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=60a1fe6a-97a5-4a9a-9fe8-733ac5bdc9d6]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-298.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=03e13cb9-52e0-4bd2-8b86-847e6947bf6b]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e269553b-c168-464f-a7dd-bc4beaad9343]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=21743d63-a80e-4210-9761-1366287c87e5]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e8b4e8af-14d3-4edf-8404-ace88ce2be54]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=78e65639-4139-4c46-b930-d21bfb7bf481]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=05d04a3d-a40f-4a8b-9b79-aa8879d71f08]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=74c7c7f9-e7af-41e3-8186-b3d5e5e80639]
module.keycloak_dev.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=df9a228b-9427-49f1-8eeb-b38daa6a0427]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3fb093c0-f7d1-4ba1-987e-363814f65908]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ddf77f5a-8101-4fca-aa54-6390449a7f03]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bd2afc16-a3a5-474a-8b47-2b30fbd6676f]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c912cdfa-fc24-440e-ae83-f9d26f34277b]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=889affb6-1e3a-4390-ba71-b0e0846dae0d]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8e62bb06-8108-4787-94d5-7c9962bb3da3]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7475da75-fab8-4a74-a2f3-98cc61f59a44]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3d6cbd85-8fe9-4d4c-98b8-1ba6237f628e]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=45505140-54f5-43f1-bbfb-c344e7ba5c4f]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f3349e82-7a5a-402a-b0bb-85f6db647a48]
module.keycloak_dev.module.onestopauth.module.client_test-08-4-2021-166.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5eba53a5-babd-4d14-a045-1f17c3e9de05]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-1060"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_test-1060.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-1060"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-1060"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://dev",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-1060"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_test-1060.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-1060"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-1060"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://prod",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "test-1060"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1060.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_test-1060.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "test-1060"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "test-1060"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://test",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1862 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*